#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(dead_code)]

/* automatically generated by rust-bindgen 0.68.1 */

pub const MAX_AXIS: u32 = 32;
pub const MAX_SPINDLE: u32 = 8;
pub const MAX_AXISNAME: u32 = 4;
pub const ALL_AXES: i32 = -1;
pub const ALL_SPINDLES: i32 = -1;
pub const MAX_IFSB_LINE: u32 = 4;
pub const MAX_CNCPATH: u32 = 15;
pub const MAX_LOCK_PROG: u32 = 12;
pub const EW_PROTOCOL: i32 = -17;
pub const EW_SOCKET: i32 = -16;
pub const EW_NODLL: i32 = -15;
pub const EW_INIERR: i32 = -14;
pub const EW_ITLOW: i32 = -13;
pub const EW_ITHIGHT: i32 = -12;
pub const EW_BUS: i32 = -11;
pub const EW_SYSTEM2: i32 = -10;
pub const EW_HSSB: i32 = -9;
pub const EW_HANDLE: i32 = -8;
pub const EW_VERSION: i32 = -7;
pub const EW_UNEXP: i32 = -6;
pub const EW_SYSTEM: i32 = -5;
pub const EW_PARITY: i32 = -4;
pub const EW_MMCSYS: i32 = -3;
pub const EW_RESET: i32 = -2;
pub const EW_BUSY: i32 = -1;
pub const EW_OK: u32 = 0;
pub const EW_FUNC: u32 = 1;
pub const EW_NOPMC: u32 = 1;
pub const EW_LENGTH: u32 = 2;
pub const EW_NUMBER: u32 = 3;
pub const EW_RANGE: u32 = 3;
pub const EW_ATTRIB: u32 = 4;
pub const EW_TYPE: u32 = 4;
pub const EW_DATA: u32 = 5;
pub const EW_NOOPT: u32 = 6;
pub const EW_PROT: u32 = 7;
pub const EW_OVRFLOW: u32 = 8;
pub const EW_PARAM: u32 = 9;
pub const EW_BUFFER: u32 = 10;
pub const EW_PATH: u32 = 11;
pub const EW_MODE: u32 = 12;
pub const EW_REJECT: u32 = 13;
pub const EW_DTSRVR: u32 = 14;
pub const EW_ALARM: u32 = 15;

pub const EW_RD_RSTFIN: u32 = 21;
pub const DNC_NORMAL: i32 = -1;
pub const DNC_CANCEL: i32 = -32768;
pub const DNC_OPENERR: i32 = -514;
pub const DNC_NOFILE: i32 = -516;
pub const DNC_READERR: i32 = -517;
pub const LIB_MODE: u32 = 0;
pub const MOVE_RDPRGPTR: u32 = 1;
pub const PRM_ALLPATH: u32 = 2;
pub const UPLOAD_M02M99: u32 = 3;
pub const MSG_NOCTRL: u32 = 4;
pub const DIAM_RAD_SWITCH: u32 = 5;
pub const MSG_CONV: u32 = 6;
pub const ASYNC_READ_PROG3: u32 = 7;
pub const UP_DNLOAD_EDT: u32 = 8;
pub const PROG_WORD_SRCH: u32 = 9;
pub const ONUM_ZERO_SUP: u32 = 10;
pub const LONG_ISE_FIG: u32 = 11;
pub const INT_CHK_UNIT: u32 = 12;
pub const HZR_PRM_WR_SKIP: u32 = 13;
pub const SLVSRAM_ACCESS: u32 = 14;
pub const GET_SMTCP_STAT: u32 = 15;
pub const TLIFE_OPTION: u32 = 16;
pub const SVGD_MATE_PUNCH: u32 = 17;
pub const READ_FLD_ON: u32 = 18;
pub const DELETE_RECURSIVE: u32 = 19;
pub const READ_ORIG_OPT: u32 = 20;
pub const SVGD_MATE_ORIGIN: u32 = 21;
pub const PUN_SFZN_MDP: u32 = 22;
pub const PAXIS_PATH: u32 = 23;
pub const AXDATA_G198: u32 = 24;
pub const BG_EDIT_SIGNAL: u32 = 25;
pub const UPLOAD_BG: u32 = 26;
pub const TDATA_EXTRACT: u32 = 27;
pub const PROG_CHECK_CMNT: u32 = 28;
pub const INITIAL_AX_CONFIG: u32 = 29;
pub const MGI_SPECIFICATION: u32 = 30;
pub const EFFECTIVE_COND: u32 = 31;
pub const LEVEL8_PROTECT: u32 = 32;
pub const ACTPT_M198: u32 = 33;
pub const SYSINFO_AXIS: u32 = 34;
pub const ALARM_INFO_TYPE: u32 = 35;
pub const PROG_LEDT_SPUP: u32 = 36;
pub const OPMSG_STATUS: u32 = 37;
pub const ASYNC_SEARCHWORD: u32 = 38;
pub const MA_OPT: u32 = 39;
pub const ENABLE_FOCAS_DMA: u32 = 40;
pub const DSHOST_RD_SRCH: u32 = 41;
pub const BG_EDIT_CONTINUE: u32 = 42;
pub const BG_EDIT_GRAPH: u32 = 43;
pub const SEARCHWORD_PNTR: u32 = 44;
pub const PROG_UPLD_PROT: u32 = 45;
pub const POLAR_IPL_POS: u32 = 46;
pub const PRG_NO_RD_PROT: u32 = 47;
pub const TOOL_STORAGE: u32 = 48;
pub const PRG_FMT_CK: u32 = 49;
pub const NCPROG_MODE: u32 = 50;
pub const COMMAND_TIMEOUT: u32 = 51;
pub const PGLOCK_TYPE: u32 = 64;
pub const TLIFE_TOOL0: u32 = 128;
pub const OPPROG_DSP: u32 = 256;
pub const OPPROG_MODE: u32 = 512;
pub const PROGRAM_CHECK: u32 = 1024;
pub const CZPP_NEDPP: u32 = 2048;
pub const MULTI_PATH_MIX_AXIS_NAME: u32 = 4096;
pub const WSETER_GRP: u32 = 8;
pub const WSETER_DATA: u32 = 8;
pub const MAX_POS_BUF: u32 = 2;
pub const TLGS_EMP: u32 = 2147483647;
pub const DC_PRM: u32 = 1;
pub const DC_OFS: u32 = 2;
pub const DC_WKZ: u32 = 3;
pub const DC_MAC: u32 = 4;
pub const DC_PCD: u32 = 5;
pub const DC_RTM: u32 = 6;
pub const MAX_PITCH_GROUP: u32 = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbact {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbact() {
    const UNINIT: ::std::mem::MaybeUninit<odbact> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbact>(),
        16usize,
        concat!("Size of: ", stringify!(odbact))
    );
    assert_eq!(
        ::std::mem::align_of::<odbact>(),
        8usize,
        concat!("Alignment of ", stringify!(odbact))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbact),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbact),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBACT = odbact;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbact2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 8usize],
}
#[test]
fn bindgen_test_layout_odbact2() {
    const UNINIT: ::std::mem::MaybeUninit<odbact2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbact2>(),
        72usize,
        concat!("Size of: ", stringify!(odbact2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbact2>(),
        8usize,
        concat!("Alignment of ", stringify!(odbact2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbact2),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbact2),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbact2),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBACT2 = odbact2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis {
    pub dummy: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbaxis() {
    const UNINIT: ::std::mem::MaybeUninit<odbaxis> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbaxis>(),
        264usize,
        concat!("Size of: ", stringify!(odbaxis))
    );
    assert_eq!(
        ::std::mem::align_of::<odbaxis>(),
        8usize,
        concat!("Alignment of ", stringify!(odbaxis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBAXIS = odbaxis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis_ex {
    pub counter: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbaxis_ex() {
    const UNINIT: ::std::mem::MaybeUninit<odbaxis_ex> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbaxis_ex>(),
        264usize,
        concat!("Size of: ", stringify!(odbaxis_ex))
    );
    assert_eq!(
        ::std::mem::align_of::<odbaxis_ex>(),
        8usize,
        concat!("Alignment of ", stringify!(odbaxis_ex))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).counter) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis_ex),
            "::",
            stringify!(counter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis_ex),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis_ex),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBAXIS_EX = odbaxis_ex;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realdata {
    pub val: f64,
    pub dec: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_realdata() {
    const UNINIT: ::std::mem::MaybeUninit<realdata> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<realdata>(),
        24usize,
        concat!("Size of: ", stringify!(realdata))
    );
    assert_eq!(
        ::std::mem::align_of::<realdata>(),
        8usize,
        concat!("Alignment of ", stringify!(realdata))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(realdata),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(realdata),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(realdata),
            "::",
            stringify!(dummy)
        )
    );
}
pub type REALDATA = realdata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwra64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_idbwra64() {
    const UNINIT: ::std::mem::MaybeUninit<idbwra64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbwra64>(),
        776usize,
        concat!("Size of: ", stringify!(idbwra64))
    );
    assert_eq!(
        ::std::mem::align_of::<idbwra64>(),
        8usize,
        concat!("Alignment of ", stringify!(idbwra64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra64),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra64),
            "::",
            stringify!(data)
        )
    );
}
pub type IDBWRA64 = idbwra64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrr64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_idbwrr64() {
    const UNINIT: ::std::mem::MaybeUninit<idbwrr64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbwrr64>(),
        776usize,
        concat!("Size of: ", stringify!(idbwrr64))
    );
    assert_eq!(
        ::std::mem::align_of::<idbwrr64>(),
        8usize,
        concat!("Alignment of ", stringify!(idbwrr64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr64),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr64),
            "::",
            stringify!(data)
        )
    );
}
pub type IDBWRR64 = idbwrr64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbcmd64 {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_char,
    pub flag: ::std::os::raw::c_short,
    pub dec_val: ::std::os::raw::c_long,
    pub cmd_val: f64,
}
#[test]
fn bindgen_test_layout_odbcmd64() {
    const UNINIT: ::std::mem::MaybeUninit<odbcmd64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbcmd64>(),
        24usize,
        concat!("Size of: ", stringify!(odbcmd64))
    );
    assert_eq!(
        ::std::mem::align_of::<odbcmd64>(),
        8usize,
        concat!("Alignment of ", stringify!(odbcmd64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcmd64),
            "::",
            stringify!(adrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcmd64),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcmd64),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcmd64),
            "::",
            stringify!(dec_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmd_val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcmd64),
            "::",
            stringify!(cmd_val)
        )
    );
}
pub type ODBCMD64 = odbcmd64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdatrng64 {
    pub data_min: f64,
    pub data_max: f64,
    pub dec: ::std::os::raw::c_long,
    pub status: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdatrng64() {
    const UNINIT: ::std::mem::MaybeUninit<odbdatrng64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdatrng64>(),
        32usize,
        concat!("Size of: ", stringify!(odbdatrng64))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdatrng64>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdatrng64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng64),
            "::",
            stringify!(data_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng64),
            "::",
            stringify!(data_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng64),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng64),
            "::",
            stringify!(status)
        )
    );
}
pub type ODBDATRNG64 = odbdatrng64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzor64 {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub data: [REALDATA; 256usize],
}
#[test]
fn bindgen_test_layout_iodbzor64() {
    const UNINIT: ::std::mem::MaybeUninit<iodbzor64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbzor64>(),
        6152usize,
        concat!("Size of: ", stringify!(iodbzor64))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbzor64>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbzor64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor64),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor64),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor64),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBZOR64 = iodbzor64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbpsd64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub u: iodbpsd64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbpsd64__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALDATA,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_iodbpsd64__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpsd64__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpsd64__bindgen_ty_1>(),
        768usize,
        concat!("Size of: ", stringify!(iodbpsd64__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpsd64__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpsd64__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(cdatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(idatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(ldatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64__bindgen_ty_1),
            "::",
            stringify!(rdatas)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbpsd64() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpsd64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpsd64>(),
        776usize,
        concat!("Size of: ", stringify!(iodbpsd64))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpsd64>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpsd64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd64),
            "::",
            stringify!(u)
        )
    );
}
pub type IODBPSD64 = iodbpsd64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbwcsf64 {
    pub dummy1: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy2: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_iodbwcsf64() {
    const UNINIT: ::std::mem::MaybeUninit<iodbwcsf64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbwcsf64>(),
        776usize,
        concat!("Size of: ", stringify!(iodbwcsf64))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbwcsf64>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbwcsf64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbwcsf64),
            "::",
            stringify!(dummy1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbwcsf64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbwcsf64),
            "::",
            stringify!(dummy2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbwcsf64),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBWCSF64 = iodbwcsf64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzofs64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_iodbzofs64() {
    const UNINIT: ::std::mem::MaybeUninit<iodbzofs64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbzofs64>(),
        776usize,
        concat!("Size of: ", stringify!(iodbzofs64))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbzofs64>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbzofs64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs64),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs64),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBZOFS64 = iodbzofs64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxis64 {
    pub dummy1: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy2: [::std::os::raw::c_short; 2usize],
    pub data: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_odbaxis64() {
    const UNINIT: ::std::mem::MaybeUninit<odbaxis64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbaxis64>(),
        776usize,
        concat!("Size of: ", stringify!(odbaxis64))
    );
    assert_eq!(
        ::std::mem::align_of::<odbaxis64>(),
        8usize,
        concat!("Alignment of ", stringify!(odbaxis64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis64),
            "::",
            stringify!(dummy1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy2) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis64),
            "::",
            stringify!(dummy2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxis64),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBAXIS64 = odbaxis64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxdt64 {
    pub name: [::std::os::raw::c_char; 4usize],
    pub dummy: [::std::os::raw::c_char; 4usize],
    pub data: f64,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub flag: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbaxdt64() {
    const UNINIT: ::std::mem::MaybeUninit<odbaxdt64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbaxdt64>(),
        24usize,
        concat!("Size of: ", stringify!(odbaxdt64))
    );
    assert_eq!(
        ::std::mem::align_of::<odbaxdt64>(),
        8usize,
        concat!("Alignment of ", stringify!(odbaxdt64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt64),
            "::",
            stringify!(reserve)
        )
    );
}
pub type ODBAXDT64 = odbaxdt64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdgn64 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub u: odbdgn64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdgn64__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALDATA,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALDATA; 32usize],
}
#[test]
fn bindgen_test_layout_odbdgn64__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdgn64__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdgn64__bindgen_ty_1>(),
        768usize,
        concat!("Size of: ", stringify!(odbdgn64__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdgn64__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdgn64__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(cdatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(idatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(ldatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64__bindgen_ty_1),
            "::",
            stringify!(rdatas)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdgn64() {
    const UNINIT: ::std::mem::MaybeUninit<odbdgn64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdgn64>(),
        776usize,
        concat!("Size of: ", stringify!(odbdgn64))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdgn64>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdgn64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdgn64),
            "::",
            stringify!(u)
        )
    );
}
pub type ODBDGN64 = odbdgn64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realmes64 {
    pub mes_val: f64,
    pub dec_val: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_realmes64() {
    const UNINIT: ::std::mem::MaybeUninit<realmes64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<realmes64>(),
        24usize,
        concat!("Size of: ", stringify!(realmes64))
    );
    assert_eq!(
        ::std::mem::align_of::<realmes64>(),
        8usize,
        concat!("Alignment of ", stringify!(realmes64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(realmes64),
            "::",
            stringify!(mes_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(realmes64),
            "::",
            stringify!(dec_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(realmes64),
            "::",
            stringify!(dummy)
        )
    );
}
pub type REALMES64 = realmes64;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_short,
    pub prgnum: ::std::os::raw::c_short,
    pub prgmnum: ::std::os::raw::c_short,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy__bindgen_ty_1 {
    pub faxis: odbdy__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbdy__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy__bindgen_ty_1__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(distance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdy__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(odbdy__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(distance)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1),
            "::",
            stringify!(faxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oaxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy__bindgen_ty_1),
            "::",
            stringify!(oaxis)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy>(),
        1064usize,
        concat!("Size of: ", stringify!(odbdy))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alarm) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(alarm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgnum) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(prgnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgmnum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(prgmnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqnum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(seqnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actf) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(actf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acts) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(acts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy),
            "::",
            stringify!(pos)
        )
    );
}
pub type ODBDY = odbdy;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy2 {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy2__bindgen_ty_1 {
    pub faxis: odbdy2__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy2__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy2__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbdy2__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy2__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy2__bindgen_ty_1__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy2__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(distance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy2__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdy2__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy2__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy2__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy2__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(distance)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy2__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy2__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy2__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy2__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1),
            "::",
            stringify!(faxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oaxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2__bindgen_ty_1),
            "::",
            stringify!(oaxis)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy2>(),
        1080usize,
        concat!("Size of: ", stringify!(odbdy2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy2>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alarm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(alarm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgnum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(prgnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgmnum) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(prgmnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqnum) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(seqnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actf) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(actf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acts) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(acts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy2),
            "::",
            stringify!(pos)
        )
    );
}
pub type ODBDY2 = odbdy2;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy3 {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy3__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy3__bindgen_ty_1 {
    pub faxis: odbdy3__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy3__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbdy3__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3__bindgen_ty_1__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(distance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdy3__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(distance)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy3__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy3__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy3__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1),
            "::",
            stringify!(faxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oaxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3__bindgen_ty_1),
            "::",
            stringify!(oaxis)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy3() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3>(),
        1080usize,
        concat!("Size of: ", stringify!(odbdy3))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alarm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(alarm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgnum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(prgnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgmnum) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(prgmnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqnum) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(seqnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actf) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(actf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acts) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(acts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3),
            "::",
            stringify!(pos)
        )
    );
}
pub type ODBDY3 = odbdy3;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbdy3m {
    pub dummy: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub alarm: ::std::os::raw::c_long,
    pub prgnum: ::std::os::raw::c_long,
    pub prgmnum: ::std::os::raw::c_long,
    pub seqnum: ::std::os::raw::c_long,
    pub actf: ::std::os::raw::c_long,
    pub acts: ::std::os::raw::c_long,
    pub pos: odbdy3m__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbdy3m__bindgen_ty_1 {
    pub faxis: odbdy3m__bindgen_ty_1__bindgen_ty_1,
    pub oaxis: odbdy3m__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3m__bindgen_ty_1__bindgen_ty_1 {
    pub absolute: [::std::os::raw::c_long; 32usize],
    pub machine: [::std::os::raw::c_long; 32usize],
    pub relative: [::std::os::raw::c_long; 32usize],
    pub distance: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_odbdy3m__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3m__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3m__bindgen_ty_1__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3m__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        768usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(distance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdy3m__bindgen_ty_1__bindgen_ty_2 {
    pub absolute: ::std::os::raw::c_long,
    pub machine: ::std::os::raw::c_long,
    pub relative: ::std::os::raw::c_long,
    pub distance: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdy3m__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3m__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3m__bindgen_ty_1__bindgen_ty_2>(),
        32usize,
        concat!("Size of: ", stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3m__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).absolute) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(absolute)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relative) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(relative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).distance) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(distance)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy3m__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3m__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3m__bindgen_ty_1>(),
        1024usize,
        concat!("Size of: ", stringify!(odbdy3m__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3m__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy3m__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1),
            "::",
            stringify!(faxis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oaxis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m__bindgen_ty_1),
            "::",
            stringify!(oaxis)
        )
    );
}
#[test]
fn bindgen_test_layout_odbdy3m() {
    const UNINIT: ::std::mem::MaybeUninit<odbdy3m> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdy3m>(),
        1080usize,
        concat!("Size of: ", stringify!(odbdy3m))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdy3m>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdy3m))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alarm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(alarm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgnum) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(prgnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prgmnum) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(prgmnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seqnum) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(seqnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actf) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(actf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acts) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(acts)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdy3m),
            "::",
            stringify!(pos)
        )
    );
}
pub type ODBDY3M = odbdy3m;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwrr {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_idbwrr() {
    const UNINIT: ::std::mem::MaybeUninit<idbwrr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbwrr>(),
        264usize,
        concat!("Size of: ", stringify!(idbwrr))
    );
    assert_eq!(
        ::std::mem::align_of::<idbwrr>(),
        8usize,
        concat!("Alignment of ", stringify!(idbwrr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwrr),
            "::",
            stringify!(data)
        )
    );
}
pub type IDBWRR = idbwrr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbwra {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_idbwra() {
    const UNINIT: ::std::mem::MaybeUninit<idbwra> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbwra>(),
        264usize,
        concat!("Size of: ", stringify!(idbwra))
    );
    assert_eq!(
        ::std::mem::align_of::<idbwra>(),
        8usize,
        concat!("Alignment of ", stringify!(idbwra))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(idbwra),
            "::",
            stringify!(data)
        )
    );
}
pub type IDBWRA = idbwra;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovl {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [[::std::os::raw::c_long; 32usize]; 2usize],
}
#[test]
fn bindgen_test_layout_iodbovl() {
    const UNINIT: ::std::mem::MaybeUninit<iodbovl> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbovl>(),
        520usize,
        concat!("Size of: ", stringify!(iodbovl))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbovl>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbovl))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovl),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovl),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovl),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBOVL = iodbovl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovlm {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [[::std::os::raw::c_long; 32usize]; 2usize],
}
#[test]
fn bindgen_test_layout_iodbovlm() {
    const UNINIT: ::std::mem::MaybeUninit<iodbovlm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbovlm>(),
        520usize,
        concat!("Size of: ", stringify!(iodbovlm))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbovlm>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbovlm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovlm),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovlm),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovlm),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBOVLM = iodbovlm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspn {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_short; 8usize],
}
#[test]
fn bindgen_test_layout_odbspn() {
    const UNINIT: ::std::mem::MaybeUninit<odbspn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbspn>(),
        20usize,
        concat!("Size of: ", stringify!(odbspn))
    );
    assert_eq!(
        ::std::mem::align_of::<odbspn>(),
        2usize,
        concat!("Alignment of ", stringify!(odbspn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspn),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspn),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspn),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBSPN = odbspn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct poselm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub disp: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_poselm() {
    const UNINIT: ::std::mem::MaybeUninit<poselm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<poselm>(),
        16usize,
        concat!("Size of: ", stringify!(poselm))
    );
    assert_eq!(
        ::std::mem::align_of::<poselm>(),
        8usize,
        concat!("Alignment of ", stringify!(poselm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disp) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(disp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suff) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(poselm),
            "::",
            stringify!(suff)
        )
    );
}
pub type POSELM = poselm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpos {
    pub abs: POSELM,
    pub mach: POSELM,
    pub rel: POSELM,
    pub dist: POSELM,
}
#[test]
fn bindgen_test_layout_odbpos() {
    const UNINIT: ::std::mem::MaybeUninit<odbpos> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpos>(),
        64usize,
        concat!("Size of: ", stringify!(odbpos))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpos>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpos))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).abs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpos),
            "::",
            stringify!(abs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mach) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpos),
            "::",
            stringify!(mach)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rel) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpos),
            "::",
            stringify!(rel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dist) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpos),
            "::",
            stringify!(dist)
        )
    );
}
pub type ODBPOS = odbpos;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbhnd {
    pub input: POSELM,
    pub output: POSELM,
}
#[test]
fn bindgen_test_layout_odbhnd() {
    const UNINIT: ::std::mem::MaybeUninit<odbhnd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbhnd>(),
        32usize,
        concat!("Size of: ", stringify!(odbhnd))
    );
    assert_eq!(
        ::std::mem::align_of::<odbhnd>(),
        8usize,
        concat!("Alignment of ", stringify!(odbhnd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).input) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbhnd),
            "::",
            stringify!(input)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbhnd),
            "::",
            stringify!(output)
        )
    );
}
pub type ODBHND = odbhnd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct speedelm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub disp: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_speedelm() {
    const UNINIT: ::std::mem::MaybeUninit<speedelm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<speedelm>(),
        16usize,
        concat!("Size of: ", stringify!(speedelm))
    );
    assert_eq!(
        ::std::mem::align_of::<speedelm>(),
        8usize,
        concat!("Alignment of ", stringify!(speedelm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disp) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(disp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suff) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(speedelm),
            "::",
            stringify!(suff)
        )
    );
}
pub type SPEEDELM = speedelm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspeed {
    pub actf: SPEEDELM,
    pub acts: SPEEDELM,
}
#[test]
fn bindgen_test_layout_odbspeed() {
    const UNINIT: ::std::mem::MaybeUninit<odbspeed> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbspeed>(),
        32usize,
        concat!("Size of: ", stringify!(odbspeed))
    );
    assert_eq!(
        ::std::mem::align_of::<odbspeed>(),
        8usize,
        concat!("Alignment of ", stringify!(odbspeed))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actf) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspeed),
            "::",
            stringify!(actf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acts) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspeed),
            "::",
            stringify!(acts)
        )
    );
}
pub type ODBSPEED = odbspeed;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbjogdrun {
    pub jogdrun: SPEEDELM,
}
#[test]
fn bindgen_test_layout_odbjogdrun() {
    const UNINIT: ::std::mem::MaybeUninit<odbjogdrun> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbjogdrun>(),
        16usize,
        concat!("Size of: ", stringify!(odbjogdrun))
    );
    assert_eq!(
        ::std::mem::align_of::<odbjogdrun>(),
        8usize,
        concat!("Alignment of ", stringify!(odbjogdrun))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jogdrun) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogdrun),
            "::",
            stringify!(jogdrun)
        )
    );
}
pub type ODBJOGDRUN = odbjogdrun;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct loadelm {
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub name: ::std::os::raw::c_char,
    pub suff1: ::std::os::raw::c_char,
    pub suff2: ::std::os::raw::c_char,
    pub reserve: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_loadelm() {
    const UNINIT: ::std::mem::MaybeUninit<loadelm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<loadelm>(),
        16usize,
        concat!("Size of: ", stringify!(loadelm))
    );
    assert_eq!(
        ::std::mem::align_of::<loadelm>(),
        8usize,
        concat!("Alignment of ", stringify!(loadelm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suff1) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(suff1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suff2) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(suff2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(loadelm),
            "::",
            stringify!(reserve)
        )
    );
}
pub type LOADELM = loadelm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbsvload {
    pub svload: LOADELM,
}
#[test]
fn bindgen_test_layout_odbsvload() {
    const UNINIT: ::std::mem::MaybeUninit<odbsvload> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbsvload>(),
        16usize,
        concat!("Size of: ", stringify!(odbsvload))
    );
    assert_eq!(
        ::std::mem::align_of::<odbsvload>(),
        8usize,
        concat!("Alignment of ", stringify!(odbsvload))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).svload) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsvload),
            "::",
            stringify!(svload)
        )
    );
}
pub type ODBSVLOAD = odbsvload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbspload {
    pub spload: LOADELM,
    pub spspeed: LOADELM,
}
#[test]
fn bindgen_test_layout_odbspload() {
    const UNINIT: ::std::mem::MaybeUninit<odbspload> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbspload>(),
        32usize,
        concat!("Size of: ", stringify!(odbspload))
    );
    assert_eq!(
        ::std::mem::align_of::<odbspload>(),
        8usize,
        concat!("Alignment of ", stringify!(odbspload))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spload) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspload),
            "::",
            stringify!(spload)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spspeed) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbspload),
            "::",
            stringify!(spspeed)
        )
    );
}
pub type ODBSPLOAD = odbspload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbaxdt {
    pub name: [::std::os::raw::c_char; 4usize],
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub flag: ::std::os::raw::c_short,
    pub reserve: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbaxdt() {
    const UNINIT: ::std::mem::MaybeUninit<odbaxdt> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbaxdt>(),
        24usize,
        concat!("Size of: ", stringify!(odbaxdt))
    );
    assert_eq!(
        ::std::mem::align_of::<odbaxdt>(),
        8usize,
        concat!("Alignment of ", stringify!(odbaxdt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flag) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(flag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reserve) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(odbaxdt),
            "::",
            stringify!(reserve)
        )
    );
}
pub type ODBAXDT = odbaxdt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbcss {
    pub srpm: ::std::os::raw::c_long,
    pub sspm: ::std::os::raw::c_long,
    pub smax: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbcss() {
    const UNINIT: ::std::mem::MaybeUninit<odbcss> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbcss>(),
        24usize,
        concat!("Size of: ", stringify!(odbcss))
    );
    assert_eq!(
        ::std::mem::align_of::<odbcss>(),
        8usize,
        concat!("Alignment of ", stringify!(odbcss))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srpm) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcss),
            "::",
            stringify!(srpm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sspm) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcss),
            "::",
            stringify!(sspm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).smax) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbcss),
            "::",
            stringify!(smax)
        )
    );
}
pub type ODBCSS = odbcss;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbsiml {
    pub t_code: ::std::os::raw::c_long,
    pub b_code: ::std::os::raw::c_long,
    pub axis_no: ::std::os::raw::c_long,
    pub machine: [::std::os::raw::c_long; 32usize],
    pub dec: [::std::os::raw::c_long; 32usize],
    pub fscsl: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbsiml() {
    const UNINIT: ::std::mem::MaybeUninit<odbsiml> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbsiml>(),
        544usize,
        concat!("Size of: ", stringify!(odbsiml))
    );
    assert_eq!(
        ::std::mem::align_of::<odbsiml>(),
        8usize,
        concat!("Alignment of ", stringify!(odbsiml))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(t_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b_code) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(b_code)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis_no) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(axis_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).machine) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(machine)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(dec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fscsl) as usize - ptr as usize },
        536usize,
        concat!(
            "Offset of field: ",
            stringify!(odbsiml),
            "::",
            stringify!(fscsl)
        )
    );
}
pub type ODBSIML = odbsiml;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbload {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_short; 32usize],
}
#[test]
fn bindgen_test_layout_odbload() {
    const UNINIT: ::std::mem::MaybeUninit<odbload> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbload>(),
        68usize,
        concat!("Size of: ", stringify!(odbload))
    );
    assert_eq!(
        ::std::mem::align_of::<odbload>(),
        2usize,
        concat!("Alignment of ", stringify!(odbload))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbload),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbload),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbload),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBLOAD = odbload;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prgpnt {
    pub prog_no: ::std::os::raw::c_long,
    pub blk_no: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_prgpnt() {
    const UNINIT: ::std::mem::MaybeUninit<prgpnt> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<prgpnt>(),
        16usize,
        concat!("Size of: ", stringify!(prgpnt))
    );
    assert_eq!(
        ::std::mem::align_of::<prgpnt>(),
        8usize,
        concat!("Alignment of ", stringify!(prgpnt))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prog_no) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(prgpnt),
            "::",
            stringify!(prog_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).blk_no) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(prgpnt),
            "::",
            stringify!(blk_no)
        )
    );
}
pub type PRGPNT = prgpnt;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbactptw {
    pub mprgno: ::std::os::raw::c_long,
    pub mblkno: ::std::os::raw::c_long,
    pub sprgno: ::std::os::raw::c_long,
    pub sblkno: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbactptw() {
    const UNINIT: ::std::mem::MaybeUninit<odbactptw> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbactptw>(),
        32usize,
        concat!("Size of: ", stringify!(odbactptw))
    );
    assert_eq!(
        ::std::mem::align_of::<odbactptw>(),
        8usize,
        concat!("Alignment of ", stringify!(odbactptw))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mprgno) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbactptw),
            "::",
            stringify!(mprgno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mblkno) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbactptw),
            "::",
            stringify!(mblkno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sprgno) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbactptw),
            "::",
            stringify!(sprgno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sblkno) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbactptw),
            "::",
            stringify!(sblkno)
        )
    );
}
pub type ODBACTPTW = odbactptw;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odb5axman {
    pub type1: ::std::os::raw::c_short,
    pub type2: ::std::os::raw::c_short,
    pub type3: ::std::os::raw::c_short,
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub c1: ::std::os::raw::c_long,
    pub c2: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_long,
    pub td: ::std::os::raw::c_long,
    pub r1: ::std::os::raw::c_long,
    pub r2: ::std::os::raw::c_long,
    pub vr: ::std::os::raw::c_long,
    pub h1: ::std::os::raw::c_long,
    pub h2: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odb5axman() {
    const UNINIT: ::std::mem::MaybeUninit<odb5axman> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odb5axman>(),
        104usize,
        concat!("Size of: ", stringify!(odb5axman))
    );
    assert_eq!(
        ::std::mem::align_of::<odb5axman>(),
        8usize,
        concat!("Alignment of ", stringify!(odb5axman))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(type1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(type2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type3) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(type3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data3) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c1) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(c1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).c2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(c2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).td) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(td)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r1) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(r1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r2) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(r2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vr) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(vr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h1) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(h1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).h2) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(odb5axman),
            "::",
            stringify!(h2)
        )
    );
}
pub type ODB5AXMAN = odb5axman;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbposfig {
    pub val: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbposfig() {
    const UNINIT: ::std::mem::MaybeUninit<odbposfig> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbposfig>(),
        16usize,
        concat!("Size of: ", stringify!(odbposfig))
    );
    assert_eq!(
        ::std::mem::align_of::<odbposfig>(),
        8usize,
        concat!("Alignment of ", stringify!(odbposfig))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbposfig),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbposfig),
            "::",
            stringify!(dec)
        )
    );
}
pub type ODBPOSFIG = odbposfig;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncdgn {
    pub ctrl_word: ::std::os::raw::c_short,
    pub can_word: ::std::os::raw::c_short,
    pub nc_file: [::std::os::raw::c_char; 16usize],
    pub read_ptr: ::std::os::raw::c_ushort,
    pub write_ptr: ::std::os::raw::c_ushort,
    pub empty_cnt: ::std::os::raw::c_ushort,
    pub total_size: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_odbdncdgn() {
    const UNINIT: ::std::mem::MaybeUninit<odbdncdgn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdncdgn>(),
        40usize,
        concat!("Size of: ", stringify!(odbdncdgn))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdncdgn>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdncdgn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl_word) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(ctrl_word)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_word) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(can_word)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nc_file) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(nc_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_ptr) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_ptr) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).empty_cnt) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(empty_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn),
            "::",
            stringify!(total_size)
        )
    );
}
pub type ODBDNCDGN = odbdncdgn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncdgn2 {
    pub ctrl_word: ::std::os::raw::c_short,
    pub can_word: ::std::os::raw::c_short,
    pub nc_file: [::std::os::raw::c_char; 64usize],
    pub read_ptr: ::std::os::raw::c_ushort,
    pub write_ptr: ::std::os::raw::c_ushort,
    pub empty_cnt: ::std::os::raw::c_ushort,
    pub total_size: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_odbdncdgn2() {
    const UNINIT: ::std::mem::MaybeUninit<odbdncdgn2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdncdgn2>(),
        88usize,
        concat!("Size of: ", stringify!(odbdncdgn2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdncdgn2>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdncdgn2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl_word) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(ctrl_word)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).can_word) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(can_word)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nc_file) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(nc_file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_ptr) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write_ptr) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).empty_cnt) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(empty_cnt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total_size) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncdgn2),
            "::",
            stringify!(total_size)
        )
    );
}
pub type ODBDNCDGN2 = odbdncdgn2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbup {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_odbup() {
    const UNINIT: ::std::mem::MaybeUninit<odbup> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbup>(),
        260usize,
        concat!("Size of: ", stringify!(odbup))
    );
    assert_eq!(
        ::std::mem::align_of::<odbup>(),
        2usize,
        concat!("Alignment of ", stringify!(odbup))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbup),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbup),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBUP = odbup;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbbuf {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbbuf() {
    const UNINIT: ::std::mem::MaybeUninit<odbbuf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbbuf>(),
        6usize,
        concat!("Size of: ", stringify!(odbbuf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbbuf>(),
        2usize,
        concat!("Alignment of ", stringify!(odbbuf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbbuf),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbbuf),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBBUF = odbbuf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprgname {
    pub name: [[::std::os::raw::c_char; 256usize]; 12usize],
}
#[test]
fn bindgen_test_layout_odbprgname() {
    const UNINIT: ::std::mem::MaybeUninit<odbprgname> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbprgname>(),
        3072usize,
        concat!("Size of: ", stringify!(odbprgname))
    );
    assert_eq!(
        ::std::mem::align_of::<odbprgname>(),
        1usize,
        concat!("Alignment of ", stringify!(odbprgname))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprgname),
            "::",
            stringify!(name)
        )
    );
}
pub type ODBPRGNAME = odbprgname;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct prgdir {
    pub prg_data: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_prgdir() {
    const UNINIT: ::std::mem::MaybeUninit<prgdir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<prgdir>(),
        256usize,
        concat!("Size of: ", stringify!(prgdir))
    );
    assert_eq!(
        ::std::mem::align_of::<prgdir>(),
        1usize,
        concat!("Alignment of ", stringify!(prgdir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prg_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(prgdir),
            "::",
            stringify!(prg_data)
        )
    );
}
pub type PRGDIR = prgdir;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct odbnc {
    pub u: odbnc__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union odbnc__bindgen_ty_1 {
    pub bin: odbnc__bindgen_ty_1__bindgen_ty_1,
    pub asc: [::std::os::raw::c_char; 31usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbnc__bindgen_ty_1__bindgen_ty_1 {
    pub reg_prg: ::std::os::raw::c_short,
    pub unreg_prg: ::std::os::raw::c_short,
    pub used_mem: ::std::os::raw::c_long,
    pub unused_mem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbnc__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbnc__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbnc__bindgen_ty_1__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(odbnc__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbnc__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(odbnc__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg_prg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(reg_prg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unreg_prg) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(unreg_prg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).used_mem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(used_mem)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unused_mem) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(unused_mem)
        )
    );
}
#[test]
fn bindgen_test_layout_odbnc__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<odbnc__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbnc__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(odbnc__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<odbnc__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(odbnc__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1),
            "::",
            stringify!(bin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).asc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnc__bindgen_ty_1),
            "::",
            stringify!(asc)
        )
    );
}
#[test]
fn bindgen_test_layout_odbnc() {
    const UNINIT: ::std::mem::MaybeUninit<odbnc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbnc>(),
        32usize,
        concat!("Size of: ", stringify!(odbnc))
    );
    assert_eq!(
        ::std::mem::align_of::<odbnc>(),
        8usize,
        concat!("Alignment of ", stringify!(odbnc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        0usize,
        concat!("Offset of field: ", stringify!(odbnc), "::", stringify!(u))
    );
}
pub type ODBNC = odbnc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpro {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_short,
    pub mdata: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpro() {
    const UNINIT: ::std::mem::MaybeUninit<odbpro> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpro>(),
        8usize,
        concat!("Size of: ", stringify!(odbpro))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpro>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpro))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpro),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpro),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mdata) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpro),
            "::",
            stringify!(mdata)
        )
    );
}
pub type ODBPRO = odbpro;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbexeprg {
    pub name: [::std::os::raw::c_char; 36usize],
    pub o_num: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbexeprg() {
    const UNINIT: ::std::mem::MaybeUninit<odbexeprg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbexeprg>(),
        48usize,
        concat!("Size of: ", stringify!(odbexeprg))
    );
    assert_eq!(
        ::std::mem::align_of::<odbexeprg>(),
        8usize,
        concat!("Alignment of ", stringify!(odbexeprg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbexeprg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_num) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbexeprg),
            "::",
            stringify!(o_num)
        )
    );
}
pub type ODBEXEPRG = odbexeprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdncprg {
    pub name: [::std::os::raw::c_char; 36usize],
    pub o_num: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdncprg() {
    const UNINIT: ::std::mem::MaybeUninit<odbdncprg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdncprg>(),
        48usize,
        concat!("Size of: ", stringify!(odbdncprg))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdncprg>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdncprg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncprg),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_num) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdncprg),
            "::",
            stringify!(o_num)
        )
    );
}
pub type ODBDNCPRG = odbdncprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbseq {
    pub dummy: [::std::os::raw::c_short; 2usize],
    pub data: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbseq() {
    const UNINIT: ::std::mem::MaybeUninit<odbseq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbseq>(),
        16usize,
        concat!("Size of: ", stringify!(odbseq))
    );
    assert_eq!(
        ::std::mem::align_of::<odbseq>(),
        8usize,
        concat!("Alignment of ", stringify!(odbseq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbseq),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbseq),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBSEQ = odbseq;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagEXEPRG {
    pub length: ::std::os::raw::c_ushort,
    pub prep_blk: ::std::os::raw::c_short,
    pub act_blk: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 512usize],
}
#[test]
fn bindgen_test_layout_tagEXEPRG() {
    const UNINIT: ::std::mem::MaybeUninit<tagEXEPRG> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagEXEPRG>(),
        520usize,
        concat!("Size of: ", stringify!(tagEXEPRG))
    );
    assert_eq!(
        ::std::mem::align_of::<tagEXEPRG>(),
        2usize,
        concat!("Alignment of ", stringify!(tagEXEPRG))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagEXEPRG),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prep_blk) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tagEXEPRG),
            "::",
            stringify!(prep_blk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).act_blk) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tagEXEPRG),
            "::",
            stringify!(act_blk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(tagEXEPRG),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagEXEPRG),
            "::",
            stringify!(data)
        )
    );
}
pub type EXEPRG = tagEXEPRG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbexeprginfo {
    pub before_buffering: EXEPRG,
    pub after_buffering: EXEPRG,
}
#[test]
fn bindgen_test_layout_odbexeprginfo() {
    const UNINIT: ::std::mem::MaybeUninit<odbexeprginfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbexeprginfo>(),
        1040usize,
        concat!("Size of: ", stringify!(odbexeprginfo))
    );
    assert_eq!(
        ::std::mem::align_of::<odbexeprginfo>(),
        2usize,
        concat!("Alignment of ", stringify!(odbexeprginfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).before_buffering) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbexeprginfo),
            "::",
            stringify!(before_buffering)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).after_buffering) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(odbexeprginfo),
            "::",
            stringify!(after_buffering)
        )
    );
}
pub type ODBEXEPRGINFO = odbexeprginfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbmdip {
    pub mdiprog: ::std::os::raw::c_short,
    pub mdipntr: ::std::os::raw::c_long,
    pub crntprog: ::std::os::raw::c_short,
    pub crntpntr: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbmdip() {
    const UNINIT: ::std::mem::MaybeUninit<odbmdip> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbmdip>(),
        32usize,
        concat!("Size of: ", stringify!(odbmdip))
    );
    assert_eq!(
        ::std::mem::align_of::<odbmdip>(),
        8usize,
        concat!("Alignment of ", stringify!(odbmdip))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mdiprog) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmdip),
            "::",
            stringify!(mdiprog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mdipntr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmdip),
            "::",
            stringify!(mdipntr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crntprog) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmdip),
            "::",
            stringify!(crntprog)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).crntpntr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmdip),
            "::",
            stringify!(crntpntr)
        )
    );
}
pub type ODBMDIP = odbmdip;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbnest {
    pub attrib: ::std::os::raw::c_ulong,
    pub comment: [::std::os::raw::c_char; 64usize],
    pub prog_name: [::std::os::raw::c_char; 245usize],
    pub dummy: [::std::os::raw::c_char; 7usize],
}
#[test]
fn bindgen_test_layout_odbnest() {
    const UNINIT: ::std::mem::MaybeUninit<odbnest> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbnest>(),
        328usize,
        concat!("Size of: ", stringify!(odbnest))
    );
    assert_eq!(
        ::std::mem::align_of::<odbnest>(),
        8usize,
        concat!("Alignment of ", stringify!(odbnest))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attrib) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnest),
            "::",
            stringify!(attrib)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comment) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnest),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prog_name) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnest),
            "::",
            stringify!(prog_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        317usize,
        concat!(
            "Offset of field: ",
            stringify!(odbnest),
            "::",
            stringify!(dummy)
        )
    );
}
pub type ODBNESTPDF = odbnest;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfdrv {
    pub max_num: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub drive: [[::std::os::raw::c_char; 12usize]; 16usize],
}
#[test]
fn bindgen_test_layout_odbpdfdrv() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfdrv> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfdrv>(),
        196usize,
        concat!("Size of: ", stringify!(odbpdfdrv))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfdrv>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpdfdrv))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfdrv),
            "::",
            stringify!(max_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfdrv),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).drive) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfdrv),
            "::",
            stringify!(drive)
        )
    );
}
pub type ODBPDFDRV = odbpdfdrv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfinf {
    pub used_page: ::std::os::raw::c_long,
    pub all_page: ::std::os::raw::c_long,
    pub used_dir: ::std::os::raw::c_long,
    pub all_dir: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbpdfinf() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfinf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfinf>(),
        32usize,
        concat!("Size of: ", stringify!(odbpdfinf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfinf>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpdfinf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).used_page) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfinf),
            "::",
            stringify!(used_page)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).all_page) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfinf),
            "::",
            stringify!(all_page)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).used_dir) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfinf),
            "::",
            stringify!(used_dir)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).all_dir) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfinf),
            "::",
            stringify!(all_dir)
        )
    );
}
pub type ODBPDFINF = odbpdfinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfsdir {
    pub path: [::std::os::raw::c_char; 212usize],
    pub req_num: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_idbpdfsdir() {
    const UNINIT: ::std::mem::MaybeUninit<idbpdfsdir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbpdfsdir>(),
        216usize,
        concat!("Size of: ", stringify!(idbpdfsdir))
    );
    assert_eq!(
        ::std::mem::align_of::<idbpdfsdir>(),
        2usize,
        concat!("Alignment of ", stringify!(idbpdfsdir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfsdir),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).req_num) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfsdir),
            "::",
            stringify!(req_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfsdir),
            "::",
            stringify!(dummy)
        )
    );
}
pub type IDBPDFSDIR = idbpdfsdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfsdir {
    pub sub_exist: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub d_f: [::std::os::raw::c_char; 36usize],
}
#[test]
fn bindgen_test_layout_odbpdfsdir() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfsdir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfsdir>(),
        40usize,
        concat!("Size of: ", stringify!(odbpdfsdir))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfsdir>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpdfsdir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sub_exist) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfsdir),
            "::",
            stringify!(sub_exist)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfsdir),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_f) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfsdir),
            "::",
            stringify!(d_f)
        )
    );
}
pub type ODBPDFSDIR = odbpdfsdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfadir {
    pub path: [::std::os::raw::c_char; 212usize],
    pub req_num: ::std::os::raw::c_short,
    pub size_kind: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_idbpdfadir() {
    const UNINIT: ::std::mem::MaybeUninit<idbpdfadir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbpdfadir>(),
        220usize,
        concat!("Size of: ", stringify!(idbpdfadir))
    );
    assert_eq!(
        ::std::mem::align_of::<idbpdfadir>(),
        2usize,
        concat!("Alignment of ", stringify!(idbpdfadir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfadir),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).req_num) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfadir),
            "::",
            stringify!(req_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size_kind) as usize - ptr as usize },
        214usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfadir),
            "::",
            stringify!(size_kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfadir),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        218usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfadir),
            "::",
            stringify!(dummy)
        )
    );
}
pub type IDBPDFADIR = idbpdfadir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfadir {
    pub data_kind: ::std::os::raw::c_short,
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub dummy2: ::std::os::raw::c_long,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub d_f: [::std::os::raw::c_char; 36usize],
    pub comment: [::std::os::raw::c_char; 52usize],
    pub o_time: [::std::os::raw::c_char; 12usize],
}
#[test]
fn bindgen_test_layout_odbpdfadir() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfadir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfadir>(),
        144usize,
        concat!("Size of: ", stringify!(odbpdfadir))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfadir>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpdfadir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_kind) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(data_kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mon) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(dummy2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attr) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).d_f) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(d_f)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comment) as usize - ptr as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_time) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfadir),
            "::",
            stringify!(o_time)
        )
    );
}
pub type ODBPDFADIR = odbpdfadir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdfprg {
    pub path: [::std::os::raw::c_char; 244usize],
    pub size_kind: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_idbpdfprg() {
    const UNINIT: ::std::mem::MaybeUninit<idbpdfprg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbpdfprg>(),
        250usize,
        concat!("Size of: ", stringify!(idbpdfprg))
    );
    assert_eq!(
        ::std::mem::align_of::<idbpdfprg>(),
        2usize,
        concat!("Alignment of ", stringify!(idbpdfprg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfprg),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size_kind) as usize - ptr as usize },
        244usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfprg),
            "::",
            stringify!(size_kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        246usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfprg),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdfprg),
            "::",
            stringify!(dummy)
        )
    );
}
pub type IDBPDFPRG = idbpdfprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfprg {
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub comment: [::std::os::raw::c_char; 52usize],
    pub o_time: [::std::os::raw::c_char; 12usize],
}
#[test]
fn bindgen_test_layout_odbpdfprg() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfprg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfprg>(),
        96usize,
        concat!("Size of: ", stringify!(odbpdfprg))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfprg>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpdfprg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mon) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comment) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(comment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).o_time) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfprg),
            "::",
            stringify!(o_time)
        )
    );
}
pub type ODBPDFPRG = odbpdfprg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprtct {
    pub disp: ::std::os::raw::c_short,
    pub edit: ::std::os::raw::c_short,
    pub encd: ::std::os::raw::c_short,
    pub lock: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbprtct() {
    const UNINIT: ::std::mem::MaybeUninit<odbprtct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbprtct>(),
        8usize,
        concat!("Size of: ", stringify!(odbprtct))
    );
    assert_eq!(
        ::std::mem::align_of::<odbprtct>(),
        2usize,
        concat!("Alignment of ", stringify!(odbprtct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct),
            "::",
            stringify!(disp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edit) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct),
            "::",
            stringify!(edit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct),
            "::",
            stringify!(encd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct),
            "::",
            stringify!(lock)
        )
    );
}
pub type ODBPRTCT = odbprtct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbprtct2 {
    pub disp: ::std::os::raw::c_short,
    pub edit: ::std::os::raw::c_short,
    pub encd: ::std::os::raw::c_short,
    pub lock: ::std::os::raw::c_short,
    pub output: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbprtct2() {
    const UNINIT: ::std::mem::MaybeUninit<odbprtct2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbprtct2>(),
        12usize,
        concat!("Size of: ", stringify!(odbprtct2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbprtct2>(),
        2usize,
        concat!("Alignment of ", stringify!(odbprtct2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).disp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(disp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).edit) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(edit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encd) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(encd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lock) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).output) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(output)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(odbprtct2),
            "::",
            stringify!(dummy)
        )
    );
}
pub type ODBPRTCT2 = odbprtct2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpdfnfil {
    pub dir_num: ::std::os::raw::c_short,
    pub file_num: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpdfnfil() {
    const UNINIT: ::std::mem::MaybeUninit<odbpdfnfil> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpdfnfil>(),
        4usize,
        concat!("Size of: ", stringify!(odbpdfnfil))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpdfnfil>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpdfnfil))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfnfil),
            "::",
            stringify!(dir_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file_num) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpdfnfil),
            "::",
            stringify!(file_num)
        )
    );
}
pub type ODBPDFNFIL = odbpdfnfil;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct idbpdftdir {
    pub slct: ::std::os::raw::c_ulong,
    pub attr: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_idbpdftdir() {
    const UNINIT: ::std::mem::MaybeUninit<idbpdftdir> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<idbpdftdir>(),
        16usize,
        concat!("Size of: ", stringify!(idbpdftdir))
    );
    assert_eq!(
        ::std::mem::align_of::<idbpdftdir>(),
        8usize,
        concat!("Alignment of ", stringify!(idbpdftdir))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).slct) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdftdir),
            "::",
            stringify!(slct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(idbpdftdir),
            "::",
            stringify!(attr)
        )
    );
}
pub type IDBPDFTDIR = idbpdftdir;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_dsfile {
    pub path: [::std::os::raw::c_char; 256usize],
    pub fnum: ::std::os::raw::c_long,
    pub offset: ::std::os::raw::c_long,
    pub req_num: ::std::os::raw::c_short,
    pub size_type: ::std::os::raw::c_short,
    pub detail: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_in_dsfile() {
    const UNINIT: ::std::mem::MaybeUninit<in_dsfile> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_dsfile>(),
        280usize,
        concat!("Size of: ", stringify!(in_dsfile))
    );
    assert_eq!(
        ::std::mem::align_of::<in_dsfile>(),
        8usize,
        concat!("Alignment of ", stringify!(in_dsfile))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).path) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fnum) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(fnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).req_num) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(req_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size_type) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(size_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).detail) as usize - ptr as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(detail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        278usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile),
            "::",
            stringify!(dummy)
        )
    );
}
pub type IN_DSFILE = in_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct out_dsinfo {
    pub type_: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub fnum: ::std::os::raw::c_long,
    pub total: ::std::os::raw::c_long,
    pub remain_h: ::std::os::raw::c_ulong,
    pub remain_l: ::std::os::raw::c_ulong,
    pub dir: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_out_dsinfo() {
    const UNINIT: ::std::mem::MaybeUninit<out_dsinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<out_dsinfo>(),
        296usize,
        concat!("Size of: ", stringify!(out_dsinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<out_dsinfo>(),
        8usize,
        concat!("Alignment of ", stringify!(out_dsinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fnum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(fnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).total) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(total)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remain_h) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(remain_h)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remain_l) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(remain_l)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dir) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsinfo),
            "::",
            stringify!(dir)
        )
    );
}
pub type OUT_DSINFO = out_dsinfo;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct out_dsfile {
    pub year: ::std::os::raw::c_short,
    pub mon: ::std::os::raw::c_short,
    pub day: ::std::os::raw::c_short,
    pub hour: ::std::os::raw::c_short,
    pub min: ::std::os::raw::c_short,
    pub sec: ::std::os::raw::c_short,
    pub size: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_ulong,
    pub file: [::std::os::raw::c_char; 36usize],
    pub info: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_out_dsfile() {
    const UNINIT: ::std::mem::MaybeUninit<out_dsfile> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<out_dsfile>(),
        200usize,
        concat!("Size of: ", stringify!(out_dsfile))
    );
    assert_eq!(
        ::std::mem::align_of::<out_dsfile>(),
        8usize,
        concat!("Alignment of ", stringify!(out_dsfile))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).year) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mon) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).day) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(day)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hour) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sec) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attr) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(attr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(out_dsfile),
            "::",
            stringify!(info)
        )
    );
}
pub type OUT_DSFILE = out_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_dsfile_req {
    pub file: [::std::os::raw::c_char; 256usize],
    pub fnum: ::std::os::raw::c_long,
    pub offset: ::std::os::raw::c_long,
    pub detail: ::std::os::raw::c_short,
    pub option: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout_in_dsfile_req() {
    const UNINIT: ::std::mem::MaybeUninit<in_dsfile_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_dsfile_req>(),
        280usize,
        concat!("Size of: ", stringify!(in_dsfile_req))
    );
    assert_eq!(
        ::std::mem::align_of::<in_dsfile_req>(),
        8usize,
        concat!("Alignment of ", stringify!(in_dsfile_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).file) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile_req),
            "::",
            stringify!(file)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fnum) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile_req),
            "::",
            stringify!(fnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile_req),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).detail) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile_req),
            "::",
            stringify!(detail)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).option) as usize - ptr as usize },
        274usize,
        concat!(
            "Offset of field: ",
            stringify!(in_dsfile_req),
            "::",
            stringify!(option)
        )
    );
}
pub type ODB_IN_DSFILE_REQ = in_dsfile_req;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_stat_dsfile {
    pub req_num: ::std::os::raw::c_short,
    pub size_type: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_in_stat_dsfile() {
    const UNINIT: ::std::mem::MaybeUninit<in_stat_dsfile> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_stat_dsfile>(),
        4usize,
        concat!("Size of: ", stringify!(in_stat_dsfile))
    );
    assert_eq!(
        ::std::mem::align_of::<in_stat_dsfile>(),
        2usize,
        concat!("Alignment of ", stringify!(in_stat_dsfile))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).req_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_stat_dsfile),
            "::",
            stringify!(req_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(in_stat_dsfile),
            "::",
            stringify!(size_type)
        )
    );
}
pub type ODB_IN_STAT_DSFILE = in_stat_dsfile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbembedfinf {
    pub used_page: ::std::os::raw::c_long,
    pub all_page: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbembedfinf() {
    const UNINIT: ::std::mem::MaybeUninit<odbembedfinf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbembedfinf>(),
        16usize,
        concat!("Size of: ", stringify!(odbembedfinf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbembedfinf>(),
        8usize,
        concat!("Alignment of ", stringify!(odbembedfinf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).used_page) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbembedfinf),
            "::",
            stringify!(used_page)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).all_page) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbembedfinf),
            "::",
            stringify!(all_page)
        )
    );
}
pub type ODBEMBEDFINF = odbembedfinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtofs {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbtofs() {
    const UNINIT: ::std::mem::MaybeUninit<odbtofs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbtofs>(),
        16usize,
        concat!("Size of: ", stringify!(odbtofs))
    );
    assert_eq!(
        ::std::mem::align_of::<odbtofs>(),
        8usize,
        concat!("Alignment of ", stringify!(odbtofs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtofs),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtofs),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtofs),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBTOFS = odbtofs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbto {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub u: iodbto__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbto__bindgen_ty_1 {
    pub m_ofs: [::std::os::raw::c_long; 5usize],
    pub m_ofs_a: [::std::os::raw::c_long; 5usize],
    pub m_ofs_b: [::std::os::raw::c_long; 10usize],
    pub m_ofs_c: [::std::os::raw::c_long; 20usize],
    pub m_ofs_at: [iodbto__bindgen_ty_1__bindgen_ty_1; 5usize],
    pub m_ofs_bt: [iodbto__bindgen_ty_1__bindgen_ty_2; 5usize],
    pub m_ofs_ct: [iodbto__bindgen_ty_1__bindgen_ty_3; 5usize],
    pub t_tip: [::std::os::raw::c_short; 5usize],
    pub t_ofs: [::std::os::raw::c_long; 5usize],
    pub t_ofs_a: [iodbto__bindgen_ty_1__bindgen_ty_4; 5usize],
    pub t_ofs_b: [iodbto__bindgen_ty_1__bindgen_ty_5; 5usize],
    pub t_ofs_2g: [::std::os::raw::c_long; 15usize],
    pub m_ofs_cnr: [::std::os::raw::c_long; 10usize],
    pub t_ofs_ex: [iodbto__bindgen_ty_1__bindgen_ty_6; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_1 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 1usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_2 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 2usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_2>(),
        24usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_3 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 4usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_3() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_3> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_3>(),
        40usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_3>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_4 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 4usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_4() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_4> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_4>(),
        40usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_4))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_4>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_4),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_5 {
    pub tip: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 8usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_5() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_5> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_5>(),
        72usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_5))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_5>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_5),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbto__bindgen_ty_1__bindgen_ty_6 {
    pub data: [::std::os::raw::c_long; 2usize],
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1__bindgen_ty_6() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1__bindgen_ty_6> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1__bindgen_ty_6>(),
        16usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1__bindgen_ty_6))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1__bindgen_ty_6>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_6)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1__bindgen_ty_6),
            "::",
            stringify!(data)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbto__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto__bindgen_ty_1>(),
        360usize,
        concat!("Size of: ", stringify!(iodbto__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbto__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_c) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_at) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_at)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_bt) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_bt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_ct) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_ct)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_tip) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_tip)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_ofs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_ofs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_ofs_a) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_ofs_a)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_ofs_b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_ofs_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_ofs_2g) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_ofs_2g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m_ofs_cnr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(m_ofs_cnr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_ofs_ex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto__bindgen_ty_1),
            "::",
            stringify!(t_ofs_ex)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbto() {
    const UNINIT: ::std::mem::MaybeUninit<iodbto> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbto>(),
        368usize,
        concat!("Size of: ", stringify!(iodbto))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbto>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbto))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbto),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!("Offset of field: ", stringify!(iodbto), "::", stringify!(u))
    );
}
pub type IODBTO = iodbto;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzofs {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_iodbzofs() {
    const UNINIT: ::std::mem::MaybeUninit<iodbzofs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbzofs>(),
        264usize,
        concat!("Size of: ", stringify!(iodbzofs))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbzofs>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbzofs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzofs),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBZOFS = iodbzofs;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbzor {
    pub datano_s: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_long; 256usize],
}
#[test]
fn bindgen_test_layout_iodbzor() {
    const UNINIT: ::std::mem::MaybeUninit<iodbzor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbzor>(),
        2056usize,
        concat!("Size of: ", stringify!(iodbzor))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbzor>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbzor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbzor),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBZOR = iodbzor;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdcode {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_iodbjogcmdcode() {
    const UNINIT: ::std::mem::MaybeUninit<iodbjogcmdcode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbjogcmdcode>(),
        16usize,
        concat!("Size of: ", stringify!(iodbjogcmdcode))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbjogcmdcode>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbjogcmdcode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdcode),
            "::",
            stringify!(adrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdcode),
            "::",
            stringify!(num)
        )
    );
}
pub type ODBJOGCMDCODE = iodbjogcmdcode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdscode {
    pub adrs: [::std::os::raw::c_char; 4usize],
    pub num: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_iodbjogcmdscode() {
    const UNINIT: ::std::mem::MaybeUninit<iodbjogcmdscode> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbjogcmdscode>(),
        16usize,
        concat!("Size of: ", stringify!(iodbjogcmdscode))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbjogcmdscode>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbjogcmdscode))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdscode),
            "::",
            stringify!(adrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdscode),
            "::",
            stringify!(num)
        )
    );
}
pub type ODBJOGCMDSCODE = iodbjogcmdscode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbjogcmdaxis {
    pub name: [::std::os::raw::c_char; 4usize],
    pub data: ::std::os::raw::c_long,
    pub dec: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_iodbjogcmdaxis() {
    const UNINIT: ::std::mem::MaybeUninit<iodbjogcmdaxis> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbjogcmdaxis>(),
        24usize,
        concat!("Size of: ", stringify!(iodbjogcmdaxis))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbjogcmdaxis>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbjogcmdaxis))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdaxis),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdaxis),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbjogcmdaxis),
            "::",
            stringify!(dec)
        )
    );
}
pub type ODBJOGCMDAXIS = iodbjogcmdaxis;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbjogcmd {
    pub gcode: ODBJOGCMDCODE,
    pub mcode: ODBJOGCMDCODE,
    pub scode: ODBJOGCMDCODE,
    pub tcode: ODBJOGCMDCODE,
    pub bcode: ODBJOGCMDCODE,
    pub padr: ODBJOGCMDCODE,
    pub extscode: [ODBJOGCMDSCODE; 4usize],
    pub axis: [ODBJOGCMDAXIS; 32usize],
    pub axis_cnt: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbjogcmd() {
    const UNINIT: ::std::mem::MaybeUninit<odbjogcmd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbjogcmd>(),
        936usize,
        concat!("Size of: ", stringify!(odbjogcmd))
    );
    assert_eq!(
        ::std::mem::align_of::<odbjogcmd>(),
        8usize,
        concat!("Alignment of ", stringify!(odbjogcmd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gcode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(gcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(mcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(scode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tcode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(tcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcode) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(bcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).padr) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(padr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extscode) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(extscode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis_cnt) as usize - ptr as usize },
        928usize,
        concat!(
            "Offset of field: ",
            stringify!(odbjogcmd),
            "::",
            stringify!(axis_cnt)
        )
    );
}
pub type ODBJOGCMD = odbjogcmd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmstp {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 7usize],
}
#[test]
fn bindgen_test_layout_iodbmstp() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmstp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmstp>(),
        14usize,
        concat!("Size of: ", stringify!(iodbmstp))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmstp>(),
        2usize,
        concat!("Alignment of ", stringify!(iodbmstp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmstp),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmstp),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmstp),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmstp),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBMSTP = iodbmstp;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct realprm {
    pub prm_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_realprm() {
    const UNINIT: ::std::mem::MaybeUninit<realprm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<realprm>(),
        16usize,
        concat!("Size of: ", stringify!(realprm))
    );
    assert_eq!(
        ::std::mem::align_of::<realprm>(),
        8usize,
        concat!("Alignment of ", stringify!(realprm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prm_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(realprm),
            "::",
            stringify!(prm_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(realprm),
            "::",
            stringify!(dec_val)
        )
    );
}
pub type REALPRM = realprm;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbpsd {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbpsd__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbpsd__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALPRM; 32usize],
}
#[test]
fn bindgen_test_layout_iodbpsd__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpsd__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpsd__bindgen_ty_1>(),
        512usize,
        concat!("Size of: ", stringify!(iodbpsd__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpsd__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpsd__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(cdatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(idatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(ldatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd__bindgen_ty_1),
            "::",
            stringify!(rdatas)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbpsd() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpsd> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpsd>(),
        520usize,
        concat!("Size of: ", stringify!(iodbpsd))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpsd>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpsd))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpsd),
            "::",
            stringify!(u)
        )
    );
}
pub type IODBPSD = iodbpsd;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbprm {
    pub datano: ::std::os::raw::c_long,
    pub type_: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_short,
    pub info: ::std::os::raw::c_short,
    pub unit: ::std::os::raw::c_short,
    pub data: [iodbprm__bindgen_ty_1; 32usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbprm__bindgen_ty_1 {
    pub prm_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_iodbprm__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbprm__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbprm__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(iodbprm__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbprm__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbprm__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prm_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm__bindgen_ty_1),
            "::",
            stringify!(prm_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm__bindgen_ty_1),
            "::",
            stringify!(dec_val)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbprm() {
    const UNINIT: ::std::mem::MaybeUninit<iodbprm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbprm>(),
        528usize,
        concat!("Size of: ", stringify!(iodbprm))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbprm>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbprm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).info) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unit) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(unit)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbprm),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBPRM = iodbprm;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbbook {
    pub param_no: ::std::os::raw::c_short,
    pub axis: ::std::os::raw::c_char,
    pub type_: ::std::os::raw::c_char,
    pub u: iodbbook__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbbook__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
}
#[test]
fn bindgen_test_layout_iodbbook__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbbook__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbbook__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(iodbbook__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbbook__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbbook__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbbook() {
    const UNINIT: ::std::mem::MaybeUninit<iodbbook> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbbook>(),
        24usize,
        concat!("Size of: ", stringify!(iodbbook))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbbook>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbbook))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).param_no) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook),
            "::",
            stringify!(param_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).axis) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook),
            "::",
            stringify!(axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbbook),
            "::",
            stringify!(u)
        )
    );
}
pub type IODBBOOK = iodbbook;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpi {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [::std::os::raw::c_char; 5usize],
}
#[test]
fn bindgen_test_layout_iodbpi() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpi> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpi>(),
        12usize,
        concat!("Size of: ", stringify!(iodbpi))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpi>(),
        2usize,
        concat!("Alignment of ", stringify!(iodbpi))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpi),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpi),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpi),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpi),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBPI = iodbpi;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovmst {
    pub adrs: ::std::os::raw::c_char,
    pub num: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_iodbovmst() {
    const UNINIT: ::std::mem::MaybeUninit<iodbovmst> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbovmst>(),
        16usize,
        concat!("Size of: ", stringify!(iodbovmst))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbovmst>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbovmst))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).adrs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovmst),
            "::",
            stringify!(adrs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovmst),
            "::",
            stringify!(num)
        )
    );
}
pub type IODBOVMST = iodbovmst;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbovstr {
    pub mcode: IODBOVMST,
    pub scode: IODBOVMST,
    pub tcode: IODBOVMST,
    pub bcode: IODBOVMST,
}
#[test]
fn bindgen_test_layout_iodbovstr() {
    const UNINIT: ::std::mem::MaybeUninit<iodbovstr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbovstr>(),
        64usize,
        concat!("Size of: ", stringify!(iodbovstr))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbovstr>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbovstr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovstr),
            "::",
            stringify!(mcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scode) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovstr),
            "::",
            stringify!(scode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tcode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovstr),
            "::",
            stringify!(tcode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bcode) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbovstr),
            "::",
            stringify!(bcode)
        )
    );
}
pub type IODBOVSTR = iodbovstr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagIODBPITCHBLK {
    pub group_num: ::std::os::raw::c_short,
    pub pginf: [tagIODBPITCHBLK__bindgen_ty_1; 8usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagIODBPITCHBLK__bindgen_ty_1 {
    pub s_no: ::std::os::raw::c_long,
    pub e_no: ::std::os::raw::c_long,
    pub attr: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_tagIODBPITCHBLK__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<tagIODBPITCHBLK__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagIODBPITCHBLK__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(tagIODBPITCHBLK__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<tagIODBPITCHBLK__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(tagIODBPITCHBLK__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_no) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagIODBPITCHBLK__bindgen_ty_1),
            "::",
            stringify!(s_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).e_no) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagIODBPITCHBLK__bindgen_ty_1),
            "::",
            stringify!(e_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagIODBPITCHBLK__bindgen_ty_1),
            "::",
            stringify!(attr)
        )
    );
}
#[test]
fn bindgen_test_layout_tagIODBPITCHBLK() {
    const UNINIT: ::std::mem::MaybeUninit<tagIODBPITCHBLK> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagIODBPITCHBLK>(),
        200usize,
        concat!("Size of: ", stringify!(tagIODBPITCHBLK))
    );
    assert_eq!(
        ::std::mem::align_of::<tagIODBPITCHBLK>(),
        8usize,
        concat!("Alignment of ", stringify!(tagIODBPITCHBLK))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).group_num) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagIODBPITCHBLK),
            "::",
            stringify!(group_num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pginf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagIODBPITCHBLK),
            "::",
            stringify!(pginf)
        )
    );
}
pub type IODBPITCHBLK = tagIODBPITCHBLK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagODBVOLC {
    pub start_no: ::std::os::raw::c_long,
    pub start_ax: ::std::os::raw::c_long,
    pub end_no: ::std::os::raw::c_long,
    pub end_ax: ::std::os::raw::c_long,
    pub num: ::std::os::raw::c_long,
    pub type_: ::std::os::raw::c_char,
    pub data: [::std::os::raw::c_long; 72usize],
}
#[test]
fn bindgen_test_layout_tagODBVOLC() {
    const UNINIT: ::std::mem::MaybeUninit<tagODBVOLC> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagODBVOLC>(),
        624usize,
        concat!("Size of: ", stringify!(tagODBVOLC))
    );
    assert_eq!(
        ::std::mem::align_of::<tagODBVOLC>(),
        8usize,
        concat!("Alignment of ", stringify!(tagODBVOLC))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_no) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(start_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start_ax) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(start_ax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_no) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(end_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ax) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(end_ax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLC),
            "::",
            stringify!(data)
        )
    );
}
pub type ODBVOLC = tagODBVOLC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbrotvolc {
    pub lin: [::std::os::raw::c_long; 3usize],
    pub rot: [::std::os::raw::c_long; 3usize],
}
#[test]
fn bindgen_test_layout_iodbrotvolc() {
    const UNINIT: ::std::mem::MaybeUninit<iodbrotvolc> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbrotvolc>(),
        48usize,
        concat!("Size of: ", stringify!(iodbrotvolc))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbrotvolc>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbrotvolc))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbrotvolc),
            "::",
            stringify!(lin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rot) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbrotvolc),
            "::",
            stringify!(rot)
        )
    );
}
pub type IODBROTVOLC = iodbrotvolc;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tagODBVOLCOMP {
    pub comp: [::std::os::raw::c_long; 5usize],
}
#[test]
fn bindgen_test_layout_tagODBVOLCOMP() {
    const UNINIT: ::std::mem::MaybeUninit<tagODBVOLCOMP> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tagODBVOLCOMP>(),
        40usize,
        concat!("Size of: ", stringify!(tagODBVOLCOMP))
    );
    assert_eq!(
        ::std::mem::align_of::<tagODBVOLCOMP>(),
        8usize,
        concat!("Alignment of ", stringify!(tagODBVOLCOMP))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comp) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tagODBVOLCOMP),
            "::",
            stringify!(comp)
        )
    );
}
pub type ODBVOLCOMP = tagODBVOLCOMP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbm {
    pub datano: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbm() {
    const UNINIT: ::std::mem::MaybeUninit<odbm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbm>(),
        24usize,
        concat!("Size of: ", stringify!(odbm))
    );
    assert_eq!(
        ::std::mem::align_of::<odbm>(),
        8usize,
        concat!("Alignment of ", stringify!(odbm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm),
            "::",
            stringify!(dec_val)
        )
    );
}
pub type ODBM = odbm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbm3 {
    pub datano: ::std::os::raw::c_long,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbm3() {
    const UNINIT: ::std::mem::MaybeUninit<odbm3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbm3>(),
        24usize,
        concat!("Size of: ", stringify!(odbm3))
    );
    assert_eq!(
        ::std::mem::align_of::<odbm3>(),
        8usize,
        concat!("Alignment of ", stringify!(odbm3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm3),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm3),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbm3),
            "::",
            stringify!(dec_val)
        )
    );
}
pub type ODBM3 = odbm3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmr {
    pub datano_s: ::std::os::raw::c_short,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_short,
    pub data: [iodbmr__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmr__bindgen_ty_1 {
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_iodbmr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(iodbmr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbmr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr__bindgen_ty_1),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr__bindgen_ty_1),
            "::",
            stringify!(dec_val)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbmr() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmr>(),
        88usize,
        concat!("Size of: ", stringify!(iodbmr))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmr>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbmr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmr),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBMR = iodbmr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_iodbmnr() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmnr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmnr>(),
        24usize,
        concat!("Size of: ", stringify!(iodbmnr))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmnr>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbmnr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr),
            "::",
            stringify!(name)
        )
    );
}
pub type IODBMRN = iodbmnr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr3 {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_iodbmnr3() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmnr3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmnr3>(),
        40usize,
        concat!("Size of: ", stringify!(iodbmnr3))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmnr3>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbmnr3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr3),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr3),
            "::",
            stringify!(name)
        )
    );
}
pub type IODBMRN3 = iodbmnr3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbmnr4 {
    pub mcr_val: f64,
    pub name: [::std::os::raw::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_iodbmnr4() {
    const UNINIT: ::std::mem::MaybeUninit<iodbmnr4> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbmnr4>(),
        72usize,
        concat!("Size of: ", stringify!(iodbmnr4))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbmnr4>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbmnr4))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr4),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbmnr4),
            "::",
            stringify!(name)
        )
    );
}
pub type IODBMRN4 = iodbmnr4;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpm {
    pub datano: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_short,
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpm() {
    const UNINIT: ::std::mem::MaybeUninit<odbpm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpm>(),
        32usize,
        concat!("Size of: ", stringify!(odbpm))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpm>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpm),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpm),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpm),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpm),
            "::",
            stringify!(dec_val)
        )
    );
}
pub type ODBPM = odbpm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpr {
    pub datano_s: ::std::os::raw::c_long,
    pub dummy: ::std::os::raw::c_short,
    pub datano_e: ::std::os::raw::c_long,
    pub data: [iodbpr__bindgen_ty_1; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbpr__bindgen_ty_1 {
    pub mcr_val: ::std::os::raw::c_long,
    pub dec_val: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_iodbpr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpr__bindgen_ty_1> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(iodbpr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcr_val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr__bindgen_ty_1),
            "::",
            stringify!(mcr_val)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dec_val) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr__bindgen_ty_1),
            "::",
            stringify!(dec_val)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbpr() {
    const UNINIT: ::std::mem::MaybeUninit<iodbpr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbpr>(),
        104usize,
        concat!("Size of: ", stringify!(iodbpr))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbpr>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbpr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_s) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr),
            "::",
            stringify!(datano_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr),
            "::",
            stringify!(dummy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano_e) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr),
            "::",
            stringify!(datano_e)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbpr),
            "::",
            stringify!(data)
        )
    );
}
pub type IODBPR = iodbpr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlinf {
    pub ofs_type: ::std::os::raw::c_short,
    pub use_no: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbtlinf() {
    const UNINIT: ::std::mem::MaybeUninit<odbtlinf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbtlinf>(),
        4usize,
        concat!("Size of: ", stringify!(odbtlinf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbtlinf>(),
        2usize,
        concat!("Alignment of ", stringify!(odbtlinf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ofs_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtlinf),
            "::",
            stringify!(ofs_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtlinf),
            "::",
            stringify!(use_no)
        )
    );
}
pub type ODBTLINF = odbtlinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbtlinf2 {
    pub ofs_type: ::std::os::raw::c_short,
    pub use_no: ::std::os::raw::c_short,
    pub ofs_enable: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbtlinf2() {
    const UNINIT: ::std::mem::MaybeUninit<odbtlinf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbtlinf2>(),
        6usize,
        concat!("Size of: ", stringify!(odbtlinf2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbtlinf2>(),
        2usize,
        concat!("Alignment of ", stringify!(odbtlinf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ofs_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtlinf2),
            "::",
            stringify!(ofs_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtlinf2),
            "::",
            stringify!(use_no)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ofs_enable) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbtlinf2),
            "::",
            stringify!(ofs_enable)
        )
    );
}
pub type ODBTLINF2 = odbtlinf2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbmvinf {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbmvinf() {
    const UNINIT: ::std::mem::MaybeUninit<odbmvinf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbmvinf>(),
        4usize,
        concat!("Size of: ", stringify!(odbmvinf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbmvinf>(),
        2usize,
        concat!("Alignment of ", stringify!(odbmvinf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmvinf),
            "::",
            stringify!(use_no1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbmvinf),
            "::",
            stringify!(use_no2)
        )
    );
}
pub type ODBMVINF = odbmvinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpminf() {
    const UNINIT: ::std::mem::MaybeUninit<odbpminf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpminf>(),
        6usize,
        concat!("Size of: ", stringify!(odbpminf))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpminf>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpminf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf),
            "::",
            stringify!(use_no1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no2) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf),
            "::",
            stringify!(use_no2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v2_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf),
            "::",
            stringify!(v2_type)
        )
    );
}
pub type ODBPMINF = odbpminf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf2 {
    pub use_no1: ::std::os::raw::c_long,
    pub use_no2: ::std::os::raw::c_long,
    pub use_no20: ::std::os::raw::c_long,
    pub v1_type: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
    pub v20_type: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpminf2() {
    const UNINIT: ::std::mem::MaybeUninit<odbpminf2> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpminf2>(),
        32usize,
        concat!("Size of: ", stringify!(odbpminf2))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpminf2>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpminf2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(use_no1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(use_no2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no20) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(use_no20)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v1_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(v1_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v2_type) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(v2_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v20_type) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf2),
            "::",
            stringify!(v20_type)
        )
    );
}
pub type ODBPMINF2 = odbpminf2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpminf3 {
    pub use_no1: ::std::os::raw::c_short,
    pub use_no2: ::std::os::raw::c_ulong,
    pub v1_type: ::std::os::raw::c_short,
    pub v2_type: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpminf3() {
    const UNINIT: ::std::mem::MaybeUninit<odbpminf3> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpminf3>(),
        24usize,
        concat!("Size of: ", stringify!(odbpminf3))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpminf3>(),
        8usize,
        concat!("Alignment of ", stringify!(odbpminf3))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf3),
            "::",
            stringify!(use_no1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).use_no2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf3),
            "::",
            stringify!(use_no2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v1_type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf3),
            "::",
            stringify!(v1_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v2_type) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpminf3),
            "::",
            stringify!(v2_type)
        )
    );
}
pub type ODBPMINF3 = odbpminf3;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbpmvalflg {
    pub exe_type: ::std::os::raw::c_short,
    pub aux_type: ::std::os::raw::c_short,
    pub tlk_type: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbpmvalflg() {
    const UNINIT: ::std::mem::MaybeUninit<odbpmvalflg> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbpmvalflg>(),
        6usize,
        concat!("Size of: ", stringify!(odbpmvalflg))
    );
    assert_eq!(
        ::std::mem::align_of::<odbpmvalflg>(),
        2usize,
        concat!("Alignment of ", stringify!(odbpmvalflg))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).exe_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpmvalflg),
            "::",
            stringify!(exe_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aux_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpmvalflg),
            "::",
            stringify!(aux_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tlk_type) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(odbpmvalflg),
            "::",
            stringify!(tlk_type)
        )
    );
}
pub type ODBPMVALFLG = odbpmvalflg;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbdatrng {
    pub data_min: ::std::os::raw::c_long,
    pub data_max: ::std::os::raw::c_long,
    pub status: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_odbdatrng() {
    const UNINIT: ::std::mem::MaybeUninit<odbdatrng> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbdatrng>(),
        24usize,
        concat!("Size of: ", stringify!(odbdatrng))
    );
    assert_eq!(
        ::std::mem::align_of::<odbdatrng>(),
        8usize,
        concat!("Alignment of ", stringify!(odbdatrng))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_min) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng),
            "::",
            stringify!(data_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng),
            "::",
            stringify!(data_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(odbdatrng),
            "::",
            stringify!(status)
        )
    );
}
pub type ODBDATRNG = odbdatrng;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ODBHOLDATA {
    pub mes_axis: [::std::os::raw::c_char; 2usize],
    pub mes_parl: [::std::os::raw::c_char; 2usize],
    pub mes_val1: [::std::os::raw::c_long; 2usize],
    pub mes_dp1: [::std::os::raw::c_long; 2usize],
    pub mes_val2: [::std::os::raw::c_long; 2usize],
    pub mes_dp2: [::std::os::raw::c_long; 2usize],
    pub mes_val3: [::std::os::raw::c_long; 2usize],
    pub mes_dp3: [::std::os::raw::c_long; 2usize],
}
#[test]
fn bindgen_test_layout_ODBHOLDATA() {
    const UNINIT: ::std::mem::MaybeUninit<ODBHOLDATA> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ODBHOLDATA>(),
        104usize,
        concat!("Size of: ", stringify!(ODBHOLDATA))
    );
    assert_eq!(
        ::std::mem::align_of::<ODBHOLDATA>(),
        8usize,
        concat!("Alignment of ", stringify!(ODBHOLDATA))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_axis) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_parl) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_parl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val1) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_val1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_dp1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_val2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp2) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_dp2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val3) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_val3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp3) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ODBHOLDATA),
            "::",
            stringify!(mes_dp3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hol64 {
    pub mes_val1: [f64; 2usize],
    pub mes_dp1: [::std::os::raw::c_long; 2usize],
    pub mes_val2: [f64; 2usize],
    pub mes_dp2: [::std::os::raw::c_long; 2usize],
    pub mes_val3: [f64; 2usize],
    pub mes_dp3: [::std::os::raw::c_long; 2usize],
    pub mes_axis: [::std::os::raw::c_char; 2usize],
    pub mes_parl: [::std::os::raw::c_char; 2usize],
}
#[test]
fn bindgen_test_layout_hol64() {
    const UNINIT: ::std::mem::MaybeUninit<hol64> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hol64>(),
        104usize,
        concat!("Size of: ", stringify!(hol64))
    );
    assert_eq!(
        ::std::mem::align_of::<hol64>(),
        8usize,
        concat!("Alignment of ", stringify!(hol64))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_val1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp1) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_dp1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val2) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_val2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp2) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_dp2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_val3) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_val3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_dp3) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_dp3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_axis) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_axis)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mes_parl) as usize - ptr as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(hol64),
            "::",
            stringify!(mes_parl)
        )
    );
}
pub type ODBHOLDATA64 = hol64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tlmsinf {
    pub t: ::std::os::raw::c_long,
    pub m: ::std::os::raw::c_long,
    pub hm: ::std::os::raw::c_long,
    pub hm_dp: ::std::os::raw::c_long,
    pub tlofs_no: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_tlmsinf() {
    const UNINIT: ::std::mem::MaybeUninit<tlmsinf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tlmsinf>(),
        40usize,
        concat!("Size of: ", stringify!(tlmsinf))
    );
    assert_eq!(
        ::std::mem::align_of::<tlmsinf>(),
        8usize,
        concat!("Alignment of ", stringify!(tlmsinf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tlmsinf),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).m) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tlmsinf),
            "::",
            stringify!(m)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hm) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tlmsinf),
            "::",
            stringify!(hm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hm_dp) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tlmsinf),
            "::",
            stringify!(hm_dp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tlofs_no) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tlmsinf),
            "::",
            stringify!(tlofs_no)
        )
    );
}
pub type ODBTLMSINF = tlmsinf;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tldata {
    pub tl: ::std::os::raw::c_long,
    pub tl_dp: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_tldata() {
    const UNINIT: ::std::mem::MaybeUninit<tldata> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tldata>(),
        16usize,
        concat!("Size of: ", stringify!(tldata))
    );
    assert_eq!(
        ::std::mem::align_of::<tldata>(),
        8usize,
        concat!("Alignment of ", stringify!(tldata))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tldata),
            "::",
            stringify!(tl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tl_dp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tldata),
            "::",
            stringify!(tl_dp)
        )
    );
}
pub type ODBTLDATA = tldata;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct hspinfo {
    pub prminfo: [[::std::os::raw::c_char; 16usize]; 8usize],
}
#[test]
fn bindgen_test_layout_hspinfo() {
    const UNINIT: ::std::mem::MaybeUninit<hspinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hspinfo>(),
        128usize,
        concat!("Size of: ", stringify!(hspinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<hspinfo>(),
        1usize,
        concat!("Alignment of ", stringify!(hspinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prminfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspinfo),
            "::",
            stringify!(prminfo)
        )
    );
}
pub type HSPINFO = hspinfo;
#[repr(C)]
#[derive(Copy, Clone)]
pub union hspdata {
    pub cdata: [::std::os::raw::c_char; 32usize],
    pub idata: [::std::os::raw::c_short; 32usize],
    pub ldata: [::std::os::raw::c_long; 32usize],
    pub rdata: [REALPRM; 32usize],
}
#[test]
fn bindgen_test_layout_hspdata() {
    const UNINIT: ::std::mem::MaybeUninit<hspdata> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hspdata>(),
        512usize,
        concat!("Size of: ", stringify!(hspdata))
    );
    assert_eq!(
        ::std::mem::align_of::<hspdata>(),
        8usize,
        concat!("Alignment of ", stringify!(hspdata))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdata),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdata),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdata),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdata),
            "::",
            stringify!(rdata)
        )
    );
}
pub type HSPDATA = hspdata;
#[repr(C)]
#[derive(Copy, Clone)]
pub union hspdatam {
    pub cdata: [::std::os::raw::c_char; 32usize],
    pub idata: [::std::os::raw::c_short; 32usize],
    pub ldata: [::std::os::raw::c_long; 32usize],
    pub rdata: [REALPRM; 32usize],
}
#[test]
fn bindgen_test_layout_hspdatam() {
    const UNINIT: ::std::mem::MaybeUninit<hspdatam> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hspdatam>(),
        512usize,
        concat!("Size of: ", stringify!(hspdatam))
    );
    assert_eq!(
        ::std::mem::align_of::<hspdatam>(),
        8usize,
        concat!("Alignment of ", stringify!(hspdatam))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdatam),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdatam),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdatam),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hspdatam),
            "::",
            stringify!(rdata)
        )
    );
}
pub type HSPDATAM = hspdatam;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct odbfofs {
    pub mcrval: ::std::os::raw::c_long,
    pub decval: ::std::os::raw::c_short,
}
#[test]
fn bindgen_test_layout_odbfofs() {
    const UNINIT: ::std::mem::MaybeUninit<odbfofs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<odbfofs>(),
        16usize,
        concat!("Size of: ", stringify!(odbfofs))
    );
    assert_eq!(
        ::std::mem::align_of::<odbfofs>(),
        8usize,
        concat!("Alignment of ", stringify!(odbfofs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mcrval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(odbfofs),
            "::",
            stringify!(mcrval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decval) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(odbfofs),
            "::",
            stringify!(decval)
        )
    );
}
pub type ODBFOFS = odbfofs;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctpr {
    pub data: iodbctpr__bindgen_ty_1,
    pub prm: [iodbctpr__bindgen_ty_2; 2usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctpr__bindgen_ty_1 {
    pub acc_bipl: [::std::os::raw::c_long; 32usize],
    pub acc_chg_time: ::std::os::raw::c_long,
    pub jerk_acc_diff: [::std::os::raw::c_long; 32usize],
    pub jerk_acc_diff_lin: [::std::os::raw::c_long; 32usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [::std::os::raw::c_long; 32usize],
    pub t_con_aipl: [::std::os::raw::c_short; 32usize],
    pub corner_feed_diff: [::std::os::raw::c_long; 32usize],
    pub max_cut_fdrate: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_iodbctpr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctpr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctpr__bindgen_ty_1>(),
        1616usize,
        concat!("Size of: ", stringify!(iodbctpr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctpr__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctpr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_bipl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(acc_bipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_chg_time) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(acc_chg_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff_lin) as usize - ptr as usize },
        520usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_diff_lin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_ratio) as usize - ptr as usize },
        776usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_acc) as usize - ptr as usize },
        784usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(max_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_con_aipl) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(t_con_aipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).corner_feed_diff) as usize - ptr as usize },
        1104usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(corner_feed_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_cut_fdrate) as usize - ptr as usize },
        1360usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_1),
            "::",
            stringify!(max_cut_fdrate)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctpr__bindgen_ty_2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbctpr__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctpr__bindgen_ty_2__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
}
#[test]
fn bindgen_test_layout_iodbctpr__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctpr__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctpr__bindgen_ty_2__bindgen_ty_1>(),
        256usize,
        concat!(
            "Size of: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctpr__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cdatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(idatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ldatas)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbctpr__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctpr__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctpr__bindgen_ty_2>(),
        264usize,
        concat!("Size of: ", stringify!(iodbctpr__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctpr__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctpr__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr__bindgen_ty_2),
            "::",
            stringify!(u)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbctpr() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctpr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctpr>(),
        2144usize,
        concat!("Size of: ", stringify!(iodbctpr))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctpr>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctpr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prm) as usize - ptr as usize },
        1616usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctpr),
            "::",
            stringify!(prm)
        )
    );
}
pub type IODBCTPR = iodbctpr;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctprm {
    pub data: iodbctprm__bindgen_ty_1,
    pub prm: [iodbctprm__bindgen_ty_2; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctprm__bindgen_ty_1 {
    pub data_160: iodbctprm__bindgen_ty_1__bindgen_ty_1,
    pub data_30i: iodbctprm__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctprm__bindgen_ty_1__bindgen_ty_1 {
    pub acc_bipl: [::std::os::raw::c_long; 8usize],
    pub acc_chg_time: ::std::os::raw::c_long,
    pub jerk_acc_diff: [::std::os::raw::c_long; 8usize],
    pub jerk_acc_diff_lin: [::std::os::raw::c_long; 8usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [::std::os::raw::c_long; 8usize],
    pub t_con_aipl: [::std::os::raw::c_short; 8usize],
    pub corner_feed_diff: [::std::os::raw::c_long; 8usize],
    pub max_cut_fdrate: [::std::os::raw::c_long; 8usize],
}
#[test]
fn bindgen_test_layout_iodbctprm__bindgen_ty_1__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm__bindgen_ty_1__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm__bindgen_ty_1__bindgen_ty_1>(),
        416usize,
        concat!(
            "Size of: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_bipl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(acc_bipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_chg_time) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(acc_chg_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff_lin) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_diff_lin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_ratio) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(jerk_acc_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_acc) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_con_aipl) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(t_con_aipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).corner_feed_diff) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(corner_feed_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_cut_fdrate) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(max_cut_fdrate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbctprm__bindgen_ty_1__bindgen_ty_2 {
    pub acc_bipl: [REALPRM; 32usize],
    pub acc_chg_time: REALPRM,
    pub jerk_acc_diff: [REALPRM; 32usize],
    pub jerk_acc_diff_lin: [REALPRM; 32usize],
    pub jerk_acc_ratio: ::std::os::raw::c_char,
    pub max_acc: [REALPRM; 32usize],
    pub t_con_aipl: [::std::os::raw::c_short; 32usize],
    pub corner_feed_diff: [REALPRM; 32usize],
    pub max_cut_fdrate: [REALPRM; 32usize],
}
#[test]
fn bindgen_test_layout_iodbctprm__bindgen_ty_1__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm__bindgen_ty_1__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm__bindgen_ty_1__bindgen_ty_2>(),
        3160usize,
        concat!(
            "Size of: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm__bindgen_ty_1__bindgen_ty_2>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_bipl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(acc_bipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acc_chg_time) as usize - ptr as usize },
        512usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(acc_chg_time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff) as usize - ptr as usize },
        528usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(jerk_acc_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_diff_lin) as usize - ptr as usize },
        1040usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(jerk_acc_diff_lin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).jerk_acc_ratio) as usize - ptr as usize },
        1552usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(jerk_acc_ratio)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_acc) as usize - ptr as usize },
        1560usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_acc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_con_aipl) as usize - ptr as usize },
        2072usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(t_con_aipl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).corner_feed_diff) as usize - ptr as usize },
        2136usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(corner_feed_diff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_cut_fdrate) as usize - ptr as usize },
        2648usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(max_cut_fdrate)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbctprm__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm__bindgen_ty_1>(),
        3160usize,
        concat!("Size of: ", stringify!(iodbctprm__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctprm__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_160) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1),
            "::",
            stringify!(data_160)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data_30i) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_1),
            "::",
            stringify!(data_30i)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct iodbctprm__bindgen_ty_2 {
    pub datano: ::std::os::raw::c_short,
    pub type_: ::std::os::raw::c_short,
    pub u: iodbctprm__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union iodbctprm__bindgen_ty_2__bindgen_ty_1 {
    pub cdata: ::std::os::raw::c_char,
    pub idata: ::std::os::raw::c_short,
    pub ldata: ::std::os::raw::c_long,
    pub rdata: REALPRM,
    pub cdatas: [::std::os::raw::c_char; 32usize],
    pub idatas: [::std::os::raw::c_short; 32usize],
    pub ldatas: [::std::os::raw::c_long; 32usize],
    pub rdatas: [REALPRM; 32usize],
}
#[test]
fn bindgen_test_layout_iodbctprm__bindgen_ty_2__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm__bindgen_ty_2__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm__bindgen_ty_2__bindgen_ty_1>(),
        512usize,
        concat!(
            "Size of: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(idata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdata) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(rdata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(cdatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).idatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(idatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(ldatas)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rdatas) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(rdatas)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbctprm__bindgen_ty_2() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm__bindgen_ty_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm__bindgen_ty_2>(),
        520usize,
        concat!("Size of: ", stringify!(iodbctprm__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctprm__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).datano) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2),
            "::",
            stringify!(datano)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm__bindgen_ty_2),
            "::",
            stringify!(u)
        )
    );
}
#[test]
fn bindgen_test_layout_iodbctprm() {
    const UNINIT: ::std::mem::MaybeUninit<iodbctprm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbctprm>(),
        4200usize,
        concat!("Size of: ", stringify!(iodbctprm))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbctprm>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbctprm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prm) as usize - ptr as usize },
        3160usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbctprm),
            "::",
            stringify!(prm)
        )
    );
}
pub type IODBCTPRM = iodbctprm;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IODBTLGS {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
    pub dummy: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_IODBTLGS() {
    const UNINIT: ::std::mem::MaybeUninit<IODBTLGS> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IODBTLGS>(),
        32usize,
        concat!("Size of: ", stringify!(IODBTLGS))
    );
    assert_eq!(
        ::std::mem::align_of::<IODBTLGS>(),
        8usize,
        concat!("Alignment of ", stringify!(IODBTLGS))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tooltype) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(tooltype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).install) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(install)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toolname) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(toolname)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dummy) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(IODBTLGS),
            "::",
            stringify!(dummy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlgsext {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub data4: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub holder: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
}
#[test]
fn bindgen_test_layout_iodbtlgsext() {
    const UNINIT: ::std::mem::MaybeUninit<iodbtlgsext> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iodbtlgsext>(),
        48usize,
        concat!("Size of: ", stringify!(iodbtlgsext))
    );
    assert_eq!(
        ::std::mem::align_of::<iodbtlgsext>(),
        8usize,
        concat!("Alignment of ", stringify!(iodbtlgsext))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data2) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data4) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(data4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tooltype) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(tooltype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).install) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(install)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).holder) as usize - ptr as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(holder)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toolname) as usize - ptr as usize },
        35usize,
        concat!(
            "Offset of field: ",
            stringify!(iodbtlgsext),
            "::",
            stringify!(toolname)
        )
    );
}
pub type IODBTLGSEXT = iodbtlgsext;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iodbtlgsext2 {
    pub data1: ::std::os::raw::c_long,
    pub data2: ::std::os::raw::c_long,
    pub data3: ::std::os::raw::c_long,
    pub data4: ::std::os::raw::c_long,
    pub data5: ::std::os::raw::c_long,
    pub data6: ::std::os::raw::c_long,
    pub data7: ::std::os::raw::c_long,
    pub data8: ::std::os::raw::c_long,
    pub data9: ::std::os::raw::c_long,
    pub data10: ::std::os::raw::c_long,
    pub tooltype: ::std::os::raw::c_char,
    pub install: ::std::os::raw::c_char,
    pub holder: ::std::os::raw::c_char,
    pub toolname: [::std::os::raw::c_char; 9usize],
}
#[test]
fn bindgen_test_layout_iodbtlgsext2() {
